// TODO проекта
// [+] - Вывод всех закладок
// [+] - sass настройка, переменные для изменяемых данных (шрифты, темы, и т.д. в настройках)
// [+] - Добавил иконки fontawesome
// [+] - Разобраться с закрытием модального нажатием на любую область вне окна
// [+] - Модальное окно для настроек
// [+] - Верстка модального окна внутри, настройки
// [-] - Изменение темы, перекинуть событие на родит. элемю. Дебагинг расширения vue-devtools
// [-] - Поправить hover в select 147 строка
// [-] - Добавить шрифты, и вообще возможность их добавления и изменения
// [-] - Вывести в файл стили и сделать возможность изменения, для тем
// [-] -
